In [4]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sb
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [5]:
print(sb.get_dataset_names())

['anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'iris', 'mpg', 'planets', 'tips', 'titanic']

In [7]:
df = sb.load_dataset('planets')
df.head(5)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [9]:
df.shape

(1035, 6)

In [10]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [11]:
df_c = df.drop(['method', 'number'], axis=1)
df_c.head(5)

   orbital_period   mass  distance  year
0         269.300   7.10     77.40  2006
1         874.774   2.21     56.95  2008
2         763.000   2.60     19.84  2011
3         326.030  19.40    110.62  2007
4         516.220  10.50    119.47  2009

In [12]:
df.number.head(5)

0    1
1    1
2    1
3    1
4    1
Name: number, dtype: int64

In [13]:
df.number.unique()

array([1, 2, 3, 5, 4, 6, 7])

In [14]:
df['number'].unique()

array([1, 2, 3, 5, 4, 6, 7])

In [15]:
df.method.unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [17]:
df.method.nunique()

10

In [18]:
len(df.method.unique())

10

In [19]:
df.rename(columns={'orbital_period':'Orbital_Period'}, inplace=True)

In [20]:
df.head(2)

            method  number  Orbital_Period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008

In [22]:
df['method'] = df['method'].replace('Radial Velocity','RV')
df.head(2)

  method  number  Orbital_Period  mass  distance  year
0     RV       1         269.300  7.10     77.40  2006
1     RV       1         874.774  2.21     56.95  2008

In [29]:
df_d = df[df.method != 'RV']
df_d.head(2)

     method  number  Orbital_Period  mass  distance  year
29  Imaging       1             NaN   NaN     45.52  2005
30  Imaging       1             NaN   NaN    165.00  2007

In [30]:
df_d.shape

(482, 6)

In [28]:
df.shape

(1035, 6)

In [31]:
df.head(5)

  method  number  Orbital_Period   mass  distance  year
0     RV       1         269.300   7.10     77.40  2006
1     RV       1         874.774   2.21     56.95  2008
2     RV       1         763.000   2.60     19.84  2011
3     RV       1         326.030  19.40    110.62  2007
4     RV       1         516.220  10.50    119.47  2009

In [33]:
df.drop(df.index[3]).head(5)

  method  number  Orbital_Period   mass  distance  year
0     RV       1         269.300   7.10     77.40  2006
1     RV       1         874.774   2.21     56.95  2008
2     RV       1         763.000   2.60     19.84  2011
4     RV       1         516.220  10.50    119.47  2009
5     RV       1         185.840   4.80     76.39  2008

In [35]:
# Create a Pandas Excel writer using XlsxWriter as the engine.
writer = pd.ExcelWriter('Planets.xlsx', engine='xlsxwriter')

# Convert the dataframe to an XlsxWriter Excel object.
df.to_excel(writer, sheet_name='Planets_Copy')

# Close the Pandas Excel writer and output the Excel file.
writer.save()